{
  "movies": [
    {
      "name": "The Lord of the Rings: The Fellowship of the Ring",
      "rating": "8.8",
      "overview": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
      "imageURL": "https://images.moviesanywhere.com/198e228b071c60f5ad57e5f62fe60029/ff22cad6-2218-414d-b853-3f95d76905c7.jpg",
      "id": 1
    },
    {
      "name": "Matrix",
      "rating": "8.7",
      "imageURL": "https://m.media-amazon.com/images/M/MV5BNzQzOTk3OTAtNDQ0Zi00ZTVkLWI0MTEtMDllZjNkYzNjNTc4L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
      "overview": "Six months after the events depicted in The Matrix, Neo has proved to be a good omen for the free humans, as more and more humans are being freed from the matrix and brought to Zion, the one and only stronghold of the Resistance. Neo himself has discovered his superpowers including super speed, ability to see the codes of the things inside the matrix and a certain degree of pre-cognition.",
      "id": 2
    },
    {
      "name": "The Dark Knight Rises",
      "rating": "8.4",
      "imageURL": "https://m.media-amazon.com/images/I/81anyi8IkDS._RI_.jpg",
      "overview": "Eight years after the Joker's reign of chaos, Batman is coerced out of exile with the assistance of the mysterious Selina Kyle in order to defend Gotham City from the vicious guerrilla terrorist Bane.",
      "id": 3
    },
    {
      "name": "Forrest Gump",
      "rating": "8.8",
      "imageURL": "https://upload.wikimedia.org/wikipedia/tr/b/bb/Forrest_Gump_%28film%2C_1994%29.jpg",
      "overview": "The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
      "id": 4
    },
    {
      "name": "Eternal Sunshine of the Spotless Mind",
      "rating": "8.3",
      "imageURL": "https://m.media-amazon.com/images/I/51J8XQhuITL._AC_SY580_.jpg",
      "overview": "When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories for ever.",
      "id": 5
    }
   
  ]
}